tailor-is/deploy/performance-test/blockchain-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Blockchain Evidence Performance Test" enabled="true">
      <stringProp name="TestPlan.comments">Tailor IS 区块链存证性能测试计划 - 目标: 50%+ 链上效率提升 (批量上链)</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">http://localhost:8107</stringProp>
            <stringProp name="Argument.desc">版权服务基础URL</stringProp>
          </elementProp>
          <elementProp name="TOKEN" elementType="Argument">
            <stringProp name="Argument.name">TOKEN</stringProp>
            <stringProp name="Argument.value">Bearer test-token-for-performance</stringProp>
            <stringProp name="Argument.desc">认证Token</stringProp>
          </elementProp>
          <elementProp name="RAMP_TIME" elementType="Argument">
            <stringProp name="Argument.name">RAMP_TIME</stringProp>
            <stringProp name="Argument.value">60</stringProp>
            <stringProp name="Argument.desc">爬升时间(秒)</stringProp>
          </elementProp>
          <elementProp name="DURATION" elementType="Argument">
            <stringProp name="Argument.name">DURATION</stringProp>
            <stringProp name="Argument.value">300</stringProp>
            <stringProp name="Argument.desc">测试持续时间(秒)</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- Thread Group 1: 50 Concurrent Users -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TG-50-Concurrent-Users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RAMP_TIME}</stringProp>
        <longProp name="ThreadGroup.start_time">1690000000000</longProp>
        <longProp name="ThreadGroup.end_time">1690000000000</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${DURATION}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- 提交版权存证 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Submit Copyright Evidence" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(target.host,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(target.port,8107)}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/copyright/submit</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <stringProp name="HTTPSampler.content_type">application/json</stringProp>
          <stringProp name="HTTPSampler.postBodyRaw">{"workTitle":"原创设计作品${__Random(1,100000)}","workType":"${__chooseRandom(DRAWING,PATTERN,DESIGN,PHOTOGRAPHY)}","authorId":"${__Random(1,10000)}","description":"这是自动生成的版权存证测试作品，用于性能压测","category":"${__chooseRandom(APPAREL,FABRIC,ACCESSORY,FOOTWEAR)}","fileHash":"${__sha256(${__RandomString(64,abcdef0123456789)})}","fileName":"design_${__time(yyyyMMddHHmmss)}_${__Random(1,9999)}.png","fileSize":${__Random(102400,52428800)}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">${TOKEN}</stringProp>
              </elementProp>
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Status Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSONExtractor guiclass="JSONPostProcessorGui" testclass="JSONExtractor" testname="Extract Copyright ID" enabled="true">
            <stringProp name="JSONExtractor.names">copyrightId</stringProp>
            <stringProp name="JSONExtractor.defaultValues">N/A</stringProp>
            <stringProp name="JSONExtractor.expressions">$.data.copyrightId</stringProp>
            <stringProp name="JSONExtractor.match_numbers">1</stringProp>
            <stringProp name="JSONExtractor.refNames">copyrightId</stringProp>
          </JSONExtractor>
          <hashTree/>
        </hashTree>

        <!-- 查询存证状态 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Query Evidence Status" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(target.host,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(target.port,8107)}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/copyright/status/${__Random(1,100000)}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">${TOKEN}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>

        <!-- 批量提交存证 (模拟批量上链触发) -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Batch Submit Evidence" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(target.host,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(target.port,8107)}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/copyright/batch-submit</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <stringProp name="HTTPSampler.content_type">application/json</stringProp>
          <stringProp name="HTTPSampler.postBodyRaw">{"works":[{"workTitle":"批量作品1","workType":"DRAWING","authorId":"${__Random(1,10000)}","fileHash":"${__sha256(${__RandomString(64,abcdef0123456789)})}","fileName":"batch1.png"},{"workTitle":"批量作品2","workType":"PATTERN","authorId":"${__Random(1,10000)}","fileHash":"${__sha256(${__RandomString(64,abcdef0123456789)})}","fileName":"batch2.png"},{"workTitle":"批量作品3","workType":"DESIGN","authorId":"${__Random(1,10000)}","fileHash":"${__sha256(${__RandomString(64,abcdef0123456789)})}","fileName":"batch3.png"},{"workTitle":"批量作品4","workType":"PHOTOGRAPHY","authorId":"${__Random(1,10000)}","fileHash":"${__sha256(${__RandomString(64,abcdef0123456789)})}","fileName":"batch4.png"},{"workTitle":"批量作品5","workType":"DRAWING","authorId":"${__Random(1,10000)}","fileHash":"${__sha256(${__RandomString(64,abcdef0123456789)})}","fileName":"batch5.png"}]}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">${TOKEN}</stringProp>
              </elementProp>
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>

        <!-- 查询存证记录列表 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Query Copyright List" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(target.host,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(target.port,8107)}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/copyright/list?authorId=${__Random(1,10000)}&amp;pageNum=1&amp;pageSize=20&amp;status=${__chooseRandom(0,1,3)}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">${TOKEN}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>

        <!-- 触发批量上链 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Trigger Batch Chain" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(target.host,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(target.port,8107)}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/copyright/trigger-batch-chain</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">${TOKEN}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- Thread Group 2: 100 Concurrent Users -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TG-100-Concurrent-Users" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RAMP_TIME}</stringProp>
        <longProp name="ThreadGroup.start_time">1690000000000</longProp>
        <longProp name="ThreadGroup.end_time">1690000000000</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${DURATION}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Submit Copyright Evidence" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(target.host,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(target.port,8107)}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/copyright/submit</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <stringProp name="HTTPSampler.content_type">application/json</stringProp>
          <stringProp name="HTTPSampler.postBodyRaw">{"workTitle":"原创设计作品${__Random(1,100000)}","workType":"${__chooseRandom(DRAWING,PATTERN,DESIGN,PHOTOGRAPHY)}","authorId":"${__Random(1,10000)}","description":"这是自动生成的版权存证测试作品，用于性能压测","category":"${__chooseRandom(APPAREL,FABRIC,ACCESSORY,FOOTWEAR)}","fileHash":"${__sha256(${__RandomString(64,abcdef0123456789)})}","fileName":"design_${__time(yyyyMMddHHmmss)}_${__Random(1,9999)}.png","fileSize":${__Random(102400,52428800)}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">${TOKEN}</stringProp>
              </elementProp>
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Batch Submit Evidence" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(target.host,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(target.port,8107)}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/copyright/batch-submit</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <stringProp name="HTTPSampler.content_type">application/json</stringProp>
          <stringProp name="HTTPSampler.postBodyRaw">{"works":[{"workTitle":"批量作品1","workType":"DRAWING","authorId":"${__Random(1,10000)}","fileHash":"${__sha256(${__RandomString(64,abcdef0123456789)})}","fileName":"batch1.png"},{"workTitle":"批量作品2","workType":"PATTERN","authorId":"${__Random(1,10000)}","fileHash":"${__sha256(${__RandomString(64,abcdef0123456789)})}","fileName":"batch2.png"},{"workTitle":"批量作品3","workType":"DESIGN","authorId":"${__Random(1,10000)}","fileHash":"${__sha256(${__RandomString(64,abcdef0123456789)})}","fileName":"batch3.png"},{"workTitle":"批量作品4","workType":"PHOTOGRAPHY","authorId":"${__Random(1,10000)}","fileHash":"${__sha256(${__RandomString(64,abcdef0123456789)})}","fileName":"batch4.png"},{"workTitle":"批量作品5","workType":"DRAWING","authorId":"${__Random(1,10000)}","fileHash":"${__sha256(${__RandomString(64,abcdef0123456789)})}","fileName":"batch5.png"}]}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">${TOKEN}</stringProp>
              </elementProp>
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Trigger Batch Chain" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(target.host,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(target.port,8107)}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/copyright/trigger-batch-chain</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">${TOKEN}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- Listeners -->
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results/blockchain-summary-${__time(yyyyMMdd-HHmmss)}.jtl</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">results/blockchain-aggregate-${__time(yyyyMMdd-HHmmss)}.jtl</stringProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
        <boolProp name="ResultCollector.error_logging">true</boolProp>
        <stringProp name="filename">results/blockchain-errors-${__time(yyyyMMdd-HHmmss)}.jtl</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>